Autodesk.Revit.DB.CustomExporter.Export(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Exports a collection of 3-D views
viewIds:
An array of 3-D views to export
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements in viewIds is not a valid 3D view.
For example, templates are not considered valid views to export.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The instance of IExportContext is not valid.
-or-
Rendering is currently not supported in the running instance of Revit.
One reason for that to happen is that rendering and material libraries
are not currently available.
Since:
2014

Autodesk.Revit.DB.CustomExporter.Export(Autodesk.Revit.DB.View3D)
Exports one 3-D view
view:
An instance of the 3-D view to export
Throws Autodesk.Revit.Exceptions.ArgumentException:
The view is not exportable, such as a template view, for example.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The instance of IExportContext is not valid.
-or-
Rendering is currently not supported in the running instance of Revit.
One reason for that to happen is that rendering and material libraries
are not currently available.
Since:
2014

Autodesk.Revit.DB.CustomExporter.IncludeFaces
This flag sets the exporter to either include or exclude
notifications about faces being processed in the export context.
Remarks:
If faces are to be excluded, the context will not receive
any of the OnFaceStart and OnFaceEnd calls; however, the
faces are still processes resulting in exporting their
geometry as respective polymeshes.
Regardless of the value of this property, the export
context must implement both OnFaceStart and OnFaceEnd
methods, even though they are never called if faces
are to be excluded.
Setting this property to allows clients to significantly speed up
export process. If the export context does not need to examine faces,
it is recommended setting this property to 'false', which will make
the export process faster even when compared with export during which
notifications about faces are given, but ignored.
Since:
2014

Autodesk.Revit.DB.CustomExporter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.IExportContext)
Constructs a new instance of a CustomExporter for a given document
using an input IExportContext to use during export.
document:
The document containing the model to be exported
IContext:
An instance of a context class that will be consuming the output
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.CustomExporter
A class that allows exporting 3D views via a custom export context.
Remarks:
The Export method of this class triggers standard rendering process
in Revit, but instead of displaying the result on screen or printer,
the output is channeled through the given custom context that handles
processing of the geometric as well as non-geometric information.
Since:
2014